src/modules/webhooks/__recordings__/TransactionChargeRequestedWebhookHandler_1851550814/Mastercard-pm_card_mastercard_3189003338/should-partially-charge-pre-authorized-card_330064185/recording.har

{
  "log": {
    "_recordingName": "TransactionChargeRequestedWebhookHandler/'Mastercard' 'pm_card_mastercard'/should partially charge pre-authorized card",
    "creator": {
      "comment": "persister:fs",
      "name": "Polly.JS",
      "version": "6.0.5"
    },
    "entries": [
      {
        "_id": "e832e0e9ad4807ac377f5e27c0fd1344",
        "_order": 0,
        "cache": {},
        "request": {
          "bodySize": 239,
          "cookies": [],
          "headers": [
            {
              "name": "accept",
              "value": "application/json"
            },
            {
              "name": "content-length",
              "value": "239"
            },
            {
              "name": "content-type",
              "value": "application/x-www-form-urlencoded"
            },
            {
              "name": "idempotency-key",
              "value": "stripe-node-retry-d0aee91b-5c13-4608-b7cc-03fc4e7da215"
            },
            {
              "name": "stripe-version",
              "value": "2023-10-16"
            },
            {
              "name": "user-agent",
              "value": "Stripe/v1 NodeBindings/14.8.0"
            }
          ],
          "headersSize": 814,
          "httpVersion": "HTTP/1.1",
          "method": "POST",
          "postData": {
            "mimeType": "application/x-www-form-urlencoded",
            "params": [],
            "text": "automatic_payment_methods[enabled]=true&automatic_payment_methods[allow_redirects]=never&amount=22299&currency=PLN&capture_method=manual&metadata[transactionId]=555555&metadata[channelId]=1&metadata[checkoutId]=c29tZS1jaGVja291dC1pZA%3D%3D"
          },
          "queryString": [],
          "url": "https://api.stripe.com/v1/payment_intents"
        },
        "response": {
          "bodySize": 1695,
          "content": {
            "mimeType": "application/json",
            "size": 1695,
            "text": {
              "amount": 22299,
              "amount_capturable": 0,
              "amount_details": {
                "tip": {}
              },
              "amount_received": 0,
              "application": null,
              "application_fee_amount": null,
              "automatic_payment_methods": {
                "allow_redirects": "never",
                "enabled": true
              },
              "canceled_at": null,
              "cancellation_reason": null,
              "capture_method": "manual",
              "client_secret": "pi_FAKE_CLIENT_SECRET",
              "confirmation_method": "automatic",
              "created": 1702477367,
              "currency": "pln",
              "customer": null,
              "description": null,
              "id": "pi_3OMtKlEosEcNBN5m1VFevvzS",
              "invoice": null,
              "last_payment_error": null,
              "latest_charge": null,
              "livemode": false,
              "metadata": {
                "channelId": "1",
                "checkoutId": "c29tZS1jaGVja291dC1pZA==",
                "transactionId": "555555"
              },
              "next_action": null,
              "object": "payment_intent",
              "on_behalf_of": null,
              "payment_method": null,
              "payment_method_configuration_details": {
                "id": "pmc_1LVZxMEosEcNBN5manO2iTW7",
                "parent": null
              },
              "payment_method_options": {
                "card": {
                  "installments": null,
                  "mandate_options": null,
                  "network": null,
                  "request_three_d_secure": "automatic"
                },
                "link": {
                  "persistent_token": null
                },
                "paypal": {
                  "preferred_locale": null,
                  "reference": null
                }
              },
              "payment_method_types": [
                "card",
                "link",
                "paypal"
              ],
              "processing": null,
              "receipt_email": null,
              "review": null,
              "setup_future_usage": null,
              "shipping": null,
              "source": null,
              "statement_descriptor": null,
              "statement_descriptor_suffix": null,
              "status": "requires_payment_method",
              "transfer_data": null,
              "transfer_group": null
            }
          },
          "cookies": [],
          "headers": [
            {
              "name": "access-control-allow-credentials",
              "value": "true"
            },
            {
              "name": "access-control-allow-methods",
              "value": "GET,HEAD,PUT,PATCH,POST,DELETE"
            },
            {
              "name": "access-control-allow-origin",
              "value": "*"
            },
            {
              "name": "access-control-expose-headers",
              "value": "Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required"
            },
            {
              "name": "access-control-max-age",
              "value": "300"
            },
            {
              "name": "cache-control",
              "value": "no-cache, no-store"
            },
            {
              "name": "connection",
              "value": "keep-alive"
            },
            {
              "name": "content-length",
              "value": "1695"
            },
            {
              "name": "content-security-policy",
              "value": "report-uri https://q.stripe.com/csp-report?p=v1%2Fpayment_intents; block-all-mixed-content; default-src 'none'; base-uri 'none'; form-action 'none'; frame-ancestors 'none'; img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'"
            },
            {
              "name": "content-type",
              "value": "application/json"
            },
            {
              "name": "date",
              "value": "Wed, 13 Dec 2023 14:22:48 GMT"
            },
            {
              "name": "idempotency-key",
              "value": "stripe-node-retry-d0aee91b-5c13-4608-b7cc-03fc4e7da215"
            },
            {
              "name": "original-request",
              "value": "req_71THGp6RZL52GV"
            },
            {
              "name": "request-id",
              "value": "req_71THGp6RZL52GV"
            },
            {
              "name": "server",
              "value": "nginx"
            },
            {
              "name": "strict-transport-security",
              "value": "max-age=63072000; includeSubDomains; preload"
            },
            {
              "name": "stripe-should-retry",
              "value": "false"
            },
            {
              "name": "stripe-version",
              "value": "2023-10-16"
            },
            {
              "name": "vary",
              "value": "Origin"
            },
            {
              "name": "x-stripe-routing-context-priority-tier",
              "value": "api-testmode"
            }
          ],
          "headersSize": 1095,
          "httpVersion": "HTTP/1.1",
          "redirectURL": "",
          "status": 200,
          "statusText": "OK"
        },
        "startedDateTime": "2023-12-13T14:22:33.646Z",
        "time": 14309,
        "timings": {
          "blocked": -1,
          "connect": -1,
          "dns": -1,
          "receive": 0,
          "send": 0,
          "ssl": -1,
          "wait": 14309
        }
      },
      {
        "_id": "b50b341e67634bf256093a6f3f69b84b",
        "_order": 0,
        "cache": {},
        "request": {
          "bodySize": 33,
          "cookies": [],
          "headers": [
            {
              "name": "accept",
              "value": "application/json"
            },
            {
              "name": "content-length",
              "value": "33"
            },
            {
              "name": "content-type",
              "value": "application/x-www-form-urlencoded"
            },
            {
              "name": "idempotency-key",
              "value": "stripe-node-retry-283f06b4-b4ff-4ae6-9541-0a8073cb2004"
            },
            {
              "name": "stripe-version",
              "value": "2023-10-16"
            },
            {
              "name": "user-agent",
              "value": "Stripe/v1 NodeBindings/14.8.0"
            }
          ],
          "headersSize": 849,
          "httpVersion": "HTTP/1.1",
          "method": "POST",
          "postData": {
            "mimeType": "application/x-www-form-urlencoded",
            "params": [],
            "text": "payment_method=pm_card_mastercard"
          },
          "queryString": [],
          "url": "https://api.stripe.com/v1/payment_intents/pi_3OMtKlEosEcNBN5m1VFevvzS/confirm"
        },
        "response": {
          "bodySize": 2461,
          "content": {
            "mimeType": "application/json",
            "size": 2461,
            "text": {
              "error": {
                "code": "payment_intent_unexpected_state",
                "doc_url": "https://stripe.com/docs/error-codes/payment-intent-unexpected-state",
                "message": "You cannot confirm this PaymentIntent because it has already succeeded after being previously confirmed.",
                "payment_intent": {
                  "amount": 22299,
                  "amount_capturable": 0,
                  "amount_details": {
                    "tip": {}
                  },
                  "amount_received": 4999,
                  "application": null,
                  "application_fee_amount": null,
                  "automatic_payment_methods": {
                    "allow_redirects": "never",
                    "enabled": true
                  },
                  "canceled_at": null,
                  "cancellation_reason": null,
                  "capture_method": "manual",
                  "client_secret": "pi_3OMtKlEosEcNBN5m1VFevvzS_secret_QVGTwOriF751jodkpZWusPIQj",
                  "confirmation_method": "automatic",
                  "created": 1702477367,
                  "currency": "pln",
                  "customer": null,
                  "description": null,
                  "id": "pi_3OMtKlEosEcNBN5m1VFevvzS",
                  "invoice": null,
                  "last_payment_error": null,
                  "latest_charge": "ch_3OMtKlEosEcNBN5m1LLfvJiR",
                  "livemode": false,
                  "metadata": {
                    "channelId": "1",
                    "checkoutId": "c29tZS1jaGVja291dC1pZA==",
                    "transactionId": "555555"
                  },
                  "next_action": null,
                  "object": "payment_intent",
                  "on_behalf_of": null,
                  "payment_method": "pm_1OMtKmEosEcNBN5mSEfE0qLi",
                  "payment_method_configuration_details": {
                    "id": "pmc_1LVZxMEosEcNBN5manO2iTW7",
                    "parent": null
                  },
                  "payment_method_options": {
                    "card": {
                      "installments": null,
                      "mandate_options": null,
                      "network": null,
                      "request_three_d_secure": "automatic"
                    },
                    "link": {
                      "persistent_token": null
                    },
                    "paypal": {
                      "preferred_locale": null,
                      "reference": null
                    }
                  },
                  "payment_method_types": [
                    "card",
                    "link",
                    "paypal"
                  ],
                  "processing": null,
                  "receipt_email": null,
                  "review": null,
                  "setup_future_usage": null,
                  "shipping": null,
                  "source": null,
                  "statement_descriptor": null,
                  "statement_descriptor_suffix": null,
                  "status": "succeeded",
                  "transfer_data": null,
                  "transfer_group": null
                },
                "request_log_url": "https://dashboard.stripe.com/test/logs/req_pYEDZ3P9tXSfGy?t=1702477939",
                "type": "invalid_request_error"
              }
            }
          },
          "cookies": [],
          "headers": [
            {
              "name": "access-control-allow-credentials",
              "value": "true"
            },
            {
              "name": "access-control-allow-methods",
              "value": "GET,HEAD,PUT,PATCH,POST,DELETE"
            },
            {
              "name": "access-control-allow-origin",
              "value": "*"
            },
            {
              "name": "access-control-expose-headers",
              "value": "Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required"
            },
            {
              "name": "access-control-max-age",
              "value": "300"
            },
            {
              "name": "cache-control",
              "value": "no-cache, no-store"
            },
            {
              "name": "connection",
              "value": "keep-alive"
            },
            {
              "name": "content-length",
              "value": "2461"
            },
            {
              "name": "content-security-policy",
              "value": "report-uri https://q.stripe.com/csp-report?p=v1%2Fpayment_intents%2F%3Aintent%2Fconfirm; block-all-mixed-content; default-src 'none'; base-uri 'none'; form-action 'none'; frame-ancestors 'none'; img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'"
            },
            {
              "name": "content-type",
              "value": "application/json"
            },
            {
              "name": "date",
              "value": "Wed, 13 Dec 2023 14:32:19 GMT"
            },
            {
              "name": "idempotency-key",
              "value": "stripe-node-retry-283f06b4-b4ff-4ae6-9541-0a8073cb2004"
            },
            {
              "name": "original-request",
              "value": "req_pYEDZ3P9tXSfGy"
            },
            {
              "name": "request-id",
              "value": "req_pYEDZ3P9tXSfGy"
            },
            {
              "name": "server",
              "value": "nginx"
            },
            {
              "name": "strict-transport-security",
              "value": "max-age=63072000; includeSubDomains; preload"
            },
            {
              "name": "stripe-version",
              "value": "2023-10-16"
            },
            {
              "name": "vary",
              "value": "Origin"
            },
            {
              "name": "x-stripe-routing-context-priority-tier",
              "value": "api-testmode"
            }
          ],
          "headersSize": 1089,
          "httpVersion": "HTTP/1.1",
          "redirectURL": "",
          "status": 400,
          "statusText": "Bad Request"
        },
        "startedDateTime": "2023-12-13T14:32:18.811Z",
        "time": 506,
        "timings": {
          "blocked": -1,
          "connect": -1,
          "dns": -1,
          "receive": 0,
          "send": 0,
          "ssl": -1,
          "wait": 506
        }
      }
    ],
    "pages": [],
    "version": "1.2"
  }
}
