src/modules/webhooks/__recordings__/TransactionChargeRequestedWebhookHandler_1851550814/Diners-Club-pm_card_diners_3136405054/should-charge-pre-authorized-card_3197581963/recording.har

{
  "log": {
    "_recordingName": "TransactionChargeRequestedWebhookHandler/'Diners Club' 'pm_card_diners'/should charge pre-authorized card",
    "creator": {
      "comment": "persister:fs",
      "name": "Polly.JS",
      "version": "6.0.5"
    },
    "entries": [
      {
        "_id": "a23519d794cb43f5fc42a9b9685c8487",
        "_order": 0,
        "cache": {},
        "request": {
          "bodySize": 150,
          "cookies": [],
          "headers": [
            {
              "name": "accept",
              "value": "application/json"
            },
            {
              "name": "content-length",
              "value": "150"
            },
            {
              "name": "content-type",
              "value": "application/x-www-form-urlencoded"
            },
            {
              "name": "stripe-version",
              "value": "2022-11-15"
            },
            {
              "name": "user-agent",
              "value": "Stripe/v1 NodeBindings/12.10.0"
            }
          ],
          "headersSize": 741,
          "httpVersion": "HTTP/1.1",
          "method": "POST",
          "postData": {
            "mimeType": "application/x-www-form-urlencoded",
            "params": [],
            "text": "amount=22299&currency=PLN&capture_method=manual&metadata[transactionId]=555555&metadata[channelId]=1&metadata[checkoutId]=c29tZS1jaGVja291dC1pZA%3D%3D"
          },
          "queryString": [],
          "url": "https://api.stripe.com/v1/payment_intents"
        },
        "response": {
          "bodySize": 1375,
          "content": {
            "mimeType": "application/json",
            "size": 1375,
            "text": {
              "amount": 22299,
              "amount_capturable": 0,
              "amount_details": {
                "tip": {}
              },
              "amount_received": 0,
              "application": null,
              "application_fee_amount": null,
              "automatic_payment_methods": null,
              "canceled_at": null,
              "cancellation_reason": null,
              "capture_method": "manual",
              "client_secret": "pi_3NRCXREosEcNBN5m0VND6xv9_secret_7DX2E9ZzbY4hv9qIx8yfUvNcZ",
              "confirmation_method": "automatic",
              "created": 1688728165,
              "currency": "pln",
              "customer": null,
              "description": null,
              "id": "pi_3NRCXREosEcNBN5m0VND6xv9",
              "invoice": null,
              "last_payment_error": null,
              "latest_charge": null,
              "livemode": false,
              "metadata": {
                "channelId": "1",
                "checkoutId": "c29tZS1jaGVja291dC1pZA==",
                "transactionId": "555555"
              },
              "next_action": null,
              "object": "payment_intent",
              "on_behalf_of": null,
              "payment_method": null,
              "payment_method_options": {
                "card": {
                  "installments": null,
                  "mandate_options": null,
                  "network": null,
                  "request_three_d_secure": "automatic"
                }
              },
              "payment_method_types": [
                "card"
              ],
              "processing": null,
              "receipt_email": null,
              "review": null,
              "setup_future_usage": null,
              "shipping": null,
              "source": null,
              "statement_descriptor": null,
              "statement_descriptor_suffix": null,
              "status": "requires_payment_method",
              "transfer_data": null,
              "transfer_group": null
            }
          },
          "cookies": [],
          "headers": [
            {
              "name": "access-control-allow-credentials",
              "value": "true"
            },
            {
              "name": "access-control-allow-methods",
              "value": "GET, POST, HEAD, OPTIONS, DELETE"
            },
            {
              "name": "access-control-allow-origin",
              "value": "*"
            },
            {
              "name": "access-control-expose-headers",
              "value": "Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required"
            },
            {
              "name": "access-control-max-age",
              "value": "300"
            },
            {
              "name": "cache-control",
              "value": "no-cache, no-store"
            },
            {
              "name": "connection",
              "value": "keep-alive"
            },
            {
              "name": "content-length",
              "value": "1375"
            },
            {
              "name": "content-type",
              "value": "application/json"
            },
            {
              "name": "date",
              "value": "Fri, 07 Jul 2023 11:09:25 GMT"
            },
            {
              "name": "idempotency-key",
              "value": "2f7fe257-e538-4216-9499-c4aa4e1fa144"
            },
            {
              "name": "original-request",
              "value": "req_dCs2Z3jPQBWBMl"
            },
            {
              "name": "request-id",
              "value": "req_dCs2Z3jPQBWBMl"
            },
            {
              "name": "server",
              "value": "nginx"
            },
            {
              "name": "strict-transport-security",
              "value": "max-age=63072000; includeSubDomains; preload"
            },
            {
              "name": "stripe-should-retry",
              "value": "false"
            },
            {
              "name": "stripe-version",
              "value": "2022-11-15"
            },
            {
              "name": "x-stripe-routing-context-priority-tier",
              "value": "api-testmode"
            }
          ],
          "headersSize": 777,
          "httpVersion": "HTTP/1.1",
          "redirectURL": "",
          "status": 200,
          "statusText": "OK"
        },
        "startedDateTime": "2023-07-07T11:09:25.232Z",
        "time": 341,
        "timings": {
          "blocked": -1,
          "connect": -1,
          "dns": -1,
          "receive": 0,
          "send": 0,
          "ssl": -1,
          "wait": 341
        }
      },
      {
        "_id": "50009ed2aa9f39c545fd989457a4f545",
        "_order": 0,
        "cache": {},
        "request": {
          "bodySize": 29,
          "cookies": [],
          "headers": [
            {
              "name": "accept",
              "value": "application/json"
            },
            {
              "name": "content-length",
              "value": "29"
            },
            {
              "name": "content-type",
              "value": "application/x-www-form-urlencoded"
            },
            {
              "name": "stripe-version",
              "value": "2022-11-15"
            },
            {
              "name": "user-agent",
              "value": "Stripe/v1 NodeBindings/12.10.0"
            }
          ],
          "headersSize": 776,
          "httpVersion": "HTTP/1.1",
          "method": "POST",
          "postData": {
            "mimeType": "application/x-www-form-urlencoded",
            "params": [],
            "text": "payment_method=pm_card_diners"
          },
          "queryString": [],
          "url": "https://api.stripe.com/v1/payment_intents/pi_3NRCXREosEcNBN5m0VND6xv9/confirm"
        },
        "response": {
          "bodySize": 1422,
          "content": {
            "mimeType": "application/json",
            "size": 1422,
            "text": {
              "amount": 22299,
              "amount_capturable": 22299,
              "amount_details": {
                "tip": {}
              },
              "amount_received": 0,
              "application": null,
              "application_fee_amount": null,
              "automatic_payment_methods": null,
              "canceled_at": null,
              "cancellation_reason": null,
              "capture_method": "manual",
              "client_secret": "pi_3NRCXREosEcNBN5m0VND6xv9_secret_7DX2E9ZzbY4hv9qIx8yfUvNcZ",
              "confirmation_method": "automatic",
              "created": 1688728165,
              "currency": "pln",
              "customer": null,
              "description": null,
              "id": "pi_3NRCXREosEcNBN5m0VND6xv9",
              "invoice": null,
              "last_payment_error": null,
              "latest_charge": "ch_3NRCXREosEcNBN5m06JKx49s",
              "livemode": false,
              "metadata": {
                "channelId": "1",
                "checkoutId": "c29tZS1jaGVja291dC1pZA==",
                "transactionId": "555555"
              },
              "next_action": null,
              "object": "payment_intent",
              "on_behalf_of": null,
              "payment_method": "pm_1NRCXREosEcNBN5mn3sd3ysi",
              "payment_method_options": {
                "card": {
                  "installments": null,
                  "mandate_options": null,
                  "network": null,
                  "request_three_d_secure": "automatic"
                }
              },
              "payment_method_types": [
                "card"
              ],
              "processing": null,
              "receipt_email": null,
              "review": null,
              "setup_future_usage": null,
              "shipping": null,
              "source": null,
              "statement_descriptor": null,
              "statement_descriptor_suffix": null,
              "status": "requires_capture",
              "transfer_data": null,
              "transfer_group": null
            }
          },
          "cookies": [],
          "headers": [
            {
              "name": "access-control-allow-credentials",
              "value": "true"
            },
            {
              "name": "access-control-allow-methods",
              "value": "GET, POST, HEAD, OPTIONS, DELETE"
            },
            {
              "name": "access-control-allow-origin",
              "value": "*"
            },
            {
              "name": "access-control-expose-headers",
              "value": "Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required"
            },
            {
              "name": "access-control-max-age",
              "value": "300"
            },
            {
              "name": "cache-control",
              "value": "no-cache, no-store"
            },
            {
              "name": "connection",
              "value": "keep-alive"
            },
            {
              "name": "content-length",
              "value": "1422"
            },
            {
              "name": "content-type",
              "value": "application/json"
            },
            {
              "name": "date",
              "value": "Fri, 07 Jul 2023 11:09:26 GMT"
            },
            {
              "name": "idempotency-key",
              "value": "92d68c8d-f892-490f-916a-e02cabbbf0ba"
            },
            {
              "name": "original-request",
              "value": "req_fvocSHhzc2NQLO"
            },
            {
              "name": "request-id",
              "value": "req_fvocSHhzc2NQLO"
            },
            {
              "name": "server",
              "value": "nginx"
            },
            {
              "name": "strict-transport-security",
              "value": "max-age=63072000; includeSubDomains; preload"
            },
            {
              "name": "stripe-should-retry",
              "value": "false"
            },
            {
              "name": "stripe-version",
              "value": "2022-11-15"
            },
            {
              "name": "x-stripe-routing-context-priority-tier",
              "value": "api-testmode"
            }
          ],
          "headersSize": 777,
          "httpVersion": "HTTP/1.1",
          "redirectURL": "",
          "status": 200,
          "statusText": "OK"
        },
        "startedDateTime": "2023-07-07T11:09:25.578Z",
        "time": 997,
        "timings": {
          "blocked": -1,
          "connect": -1,
          "dns": -1,
          "receive": 0,
          "send": 0,
          "ssl": -1,
          "wait": 997
        }
      },
      {
        "_id": "a613d89be451c56fdce7ce11fce4ea40",
        "_order": 0,
        "cache": {},
        "request": {
          "bodySize": 23,
          "cookies": [],
          "headers": [
            {
              "name": "accept",
              "value": "application/json"
            },
            {
              "name": "content-length",
              "value": "23"
            },
            {
              "name": "content-type",
              "value": "application/x-www-form-urlencoded"
            },
            {
              "name": "stripe-version",
              "value": "2022-11-15"
            },
            {
              "name": "user-agent",
              "value": "Stripe/v1 NodeBindings/12.10.0"
            }
          ],
          "headersSize": 776,
          "httpVersion": "HTTP/1.1",
          "method": "POST",
          "postData": {
            "mimeType": "application/x-www-form-urlencoded",
            "params": [],
            "text": "amount_to_capture=22299"
          },
          "queryString": [],
          "url": "https://api.stripe.com/v1/payment_intents/pi_3NRCXREosEcNBN5m0VND6xv9/capture"
        },
        "response": {
          "bodySize": 1415,
          "content": {
            "mimeType": "application/json",
            "size": 1415,
            "text": {
              "amount": 22299,
              "amount_capturable": 0,
              "amount_details": {
                "tip": {}
              },
              "amount_received": 22299,
              "application": null,
              "application_fee_amount": null,
              "automatic_payment_methods": null,
              "canceled_at": null,
              "cancellation_reason": null,
              "capture_method": "manual",
              "client_secret": "pi_3NRCXREosEcNBN5m0VND6xv9_secret_7DX2E9ZzbY4hv9qIx8yfUvNcZ",
              "confirmation_method": "automatic",
              "created": 1688728165,
              "currency": "pln",
              "customer": null,
              "description": null,
              "id": "pi_3NRCXREosEcNBN5m0VND6xv9",
              "invoice": null,
              "last_payment_error": null,
              "latest_charge": "ch_3NRCXREosEcNBN5m06JKx49s",
              "livemode": false,
              "metadata": {
                "channelId": "1",
                "checkoutId": "c29tZS1jaGVja291dC1pZA==",
                "transactionId": "555555"
              },
              "next_action": null,
              "object": "payment_intent",
              "on_behalf_of": null,
              "payment_method": "pm_1NRCXREosEcNBN5mn3sd3ysi",
              "payment_method_options": {
                "card": {
                  "installments": null,
                  "mandate_options": null,
                  "network": null,
                  "request_three_d_secure": "automatic"
                }
              },
              "payment_method_types": [
                "card"
              ],
              "processing": null,
              "receipt_email": null,
              "review": null,
              "setup_future_usage": null,
              "shipping": null,
              "source": null,
              "statement_descriptor": null,
              "statement_descriptor_suffix": null,
              "status": "succeeded",
              "transfer_data": null,
              "transfer_group": null
            }
          },
          "cookies": [],
          "headers": [
            {
              "name": "access-control-allow-credentials",
              "value": "true"
            },
            {
              "name": "access-control-allow-methods",
              "value": "GET, POST, HEAD, OPTIONS, DELETE"
            },
            {
              "name": "access-control-allow-origin",
              "value": "*"
            },
            {
              "name": "access-control-expose-headers",
              "value": "Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required"
            },
            {
              "name": "access-control-max-age",
              "value": "300"
            },
            {
              "name": "cache-control",
              "value": "no-cache, no-store"
            },
            {
              "name": "connection",
              "value": "keep-alive"
            },
            {
              "name": "content-length",
              "value": "1415"
            },
            {
              "name": "content-type",
              "value": "application/json"
            },
            {
              "name": "date",
              "value": "Fri, 07 Jul 2023 11:09:27 GMT"
            },
            {
              "name": "idempotency-key",
              "value": "9a4410b6-98a8-454c-97db-81f74e86f262"
            },
            {
              "name": "original-request",
              "value": "req_HW49AZMztxmLHm"
            },
            {
              "name": "request-id",
              "value": "req_HW49AZMztxmLHm"
            },
            {
              "name": "server",
              "value": "nginx"
            },
            {
              "name": "strict-transport-security",
              "value": "max-age=63072000; includeSubDomains; preload"
            },
            {
              "name": "stripe-should-retry",
              "value": "false"
            },
            {
              "name": "stripe-version",
              "value": "2022-11-15"
            },
            {
              "name": "x-stripe-routing-context-priority-tier",
              "value": "api-testmode"
            }
          ],
          "headersSize": 777,
          "httpVersion": "HTTP/1.1",
          "redirectURL": "",
          "status": 200,
          "statusText": "OK"
        },
        "startedDateTime": "2023-07-07T11:09:26.578Z",
        "time": 806,
        "timings": {
          "blocked": -1,
          "connect": -1,
          "dns": -1,
          "receive": 0,
          "send": 0,
          "ssl": -1,
          "wait": 806
        }
      }
    ],
    "pages": [],
    "version": "1.2"
  }
}
